Revit 2027 API
VertexStreamPositionColored.AddVertex Method
 Inserts a VertexStreamPositionColored into the stream and associated buffer.
Namespace: Autodesk.Revit.DB.DirectContext3D
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public void AddVertex(
	VertexPositionColored vertex
)
Public Sub AddVertex (
	vertex As VertexPositionColored
)
public:
void AddVertex(
	VertexPositionColored^ vertex
)
member AddVertex :
        vertex : VertexPositionColored -> unit
Parameters
vertex VertexPositionColored
 The vertex to be inserted.
Exceptions
Exception | Condition
ArgumentNullException |  A non-optional argument was null
InvalidOperationException |  Thrown if the associated buffer is not mapped. -or- Thrown if the associated buffer has insufficient space.
See Also
Reference
VertexStreamPositionColored Class
Autodesk.Revit.DB.DirectContext3D Namespace